In [3]:
import pandas as pd
pd.set_option('display.max_columns',10)
print("Original Data:\n")
df=pd.read_excel("/Users/student/Downloads/marksexcel.xlsx")
print(df)

Original Data:

   Unnamed: 0  S.no.     Name  Roll no.  English  Tamil  Maths   Science  \
0           0      1   Sankar         1       65     97      45       58
1           1      2  C Mohan         2       77     88      38       47
2           2      3   ramesh         3       88     66      56       76
3           3      4   dinesh         4       93     79      30       80
4           4      5   ashwin         5       65     80      40       45
5           5      6   jeevan         6       44     44      70       87
6           6      7      anu         7       89     93      89       98
7           7      8   mukesh         8       66     88      98       73
8           8      9   kishor         9       79     77      77       20
9           9     10     josh        10       80     65      66       78

   Social  Total
0      77    342
1      55    305
2      90    376
3      89    371
4      67    297
5      76    321
6      45    414
7      54    379
8      86    339
9      20    309

In [5]:
f=df['Name'].str.strip()
f.to_excel("/Users/student/Downloads/marksexcel2.xlsx")

In [7]:
print(f)

0     Sankar
1    C Mohan
2     ramesh
3     dinesh
4     ashwin
5     jeevan
6        anu
7     mukesh
8     kishor
9       josh
Name: Name, dtype: object

In [9]:
print("\n Replace Value:")
k=df.fillna(method="Pad")
print(k)
print("\n")
k.to_excel("/Users/student/Downloads/marksexcel.xlsx")

 Replace Value:
   Unnamed: 0  S.no.     Name  Roll no.  English  Tamil  Maths   Science  \
0           0      1   Sankar         1       65     97      45       58
1           1      2  C Mohan         2       77     88      38       47
2           2      3   ramesh         3       88     66      56       76
3           3      4   dinesh         4       93     79      30       80
4           4      5   ashwin         5       65     80      40       45
5           5      6   jeevan         6       44     44      70       87
6           6      7      anu         7       89     93      89       98
7           7      8   mukesh         8       66     88      98       73
8           8      9   kishor         9       79     77      77       20
9           9     10     josh        10       80     65      66       78

   Social  Total
0      77    342
1      55    305
2      90    376
3      89    371
4      67    297
5      76    321
6      45    414
7      54    379
8      86    339
9      20    309

In [11]:
#drop one particular column
print("\n")
k.drop(['Total'],axis=1,inplace=True)
print(k)
print("\n")
k.to_excel("/Users/student/Downloads/marksexcel.xlsx")

   Unnamed: 0  S.no.     Name  Roll no.  English  Tamil  Maths   Science  \
0           0      1   Sankar         1       65     97      45       58
1           1      2  C Mohan         2       77     88      38       47
2           2      3   ramesh         3       88     66      56       76
3           3      4   dinesh         4       93     79      30       80
4           4      5   ashwin         5       65     80      40       45
5           5      6   jeevan         6       44     44      70       87
6           6      7      anu         7       89     93      89       98
7           7      8   mukesh         8       66     88      98       73
8           8      9   kishor         9       79     77      77       20
9           9     10     josh        10       80     65      66       78

   Social
0      77
1      55
2      90
3      89
4      67
5      76
6      45
7      54
8      86
9      20

In [13]:
#replace the values
import pandas as pd
n=pd.read_excel("/Users/student/Downloads/marksexcel.xlsx")
print(n)
y=n.replace({89:88})
print(y)
y.to_excel("/Users/student/Downloads/marksexcel.xlsx")

   Unnamed: 0.1  Unnamed: 0  S.no.     Name  Roll no.  English  Tamil  Maths   \
0             0           0      1   Sankar         1       65     97      45
1             1           1      2  C Mohan         2       77     88      38
2             2           2      3   ramesh         3       88     66      56
3             3           3      4   dinesh         4       93     79      30
4             4           4      5   ashwin         5       65     80      40
5             5           5      6   jeevan         6       44     44      70
6             6           6      7      anu         7       89     93      89
7             7           7      8   mukesh         8       66     88      98
8             8           8      9   kishor         9       79     77      77
9             9           9     10     josh        10       80     65      66

   Science  Social
0       58      77
1       47      55
2       76      90
3       80      89
4       45      67
5       87      76
6       98      45
7       73      54
8       20      86
9       78      20
   Unnamed: 0.1  Unnamed: 0  S.no.     Name  Roll no.  English  Tamil  Maths   \
0             0           0      1   Sankar         1       65     97      45
1             1           1      2  C Mohan         2       77     88      38
2             2           2      3   ramesh         3       88     66      56
3             3           3      4   dinesh         4       93     79      30
4             4           4      5   ashwin         5       65     80      40
5             5           5      6   jeevan         6       44     44      70
6             6           6      7      anu         7       88     93      88
7             7           7      8   mukesh         8       66     88      98
8             8           8      9   kishor         9       79     77      77
9             9           9     10     josh        10       80     65      66

   Science  Social
0       58      77
1       47      55
2       76      90
3       80      88
4       45      67
5       87      76
6       98      45
7       73      54
8       20      86
9       78      20

In [15]:
#to extract using is in () fn
df=pd.read_excel("/Users/student/Downloads/marksexcel.xlsx")
new=df['Tamil'].isin([88])
print(df[new])

   Unnamed: 0.2  Unnamed: 0.1  Unnamed: 0  S.no.     Name  ...  English  \
1             1             1           1      2  C Mohan  ...       77
7             7             7           7      8   mukesh  ...       66

   Tamil  Maths   Science  Social
1     88      38       47      55
7     88      98       73      54

[2 rows x 11 columns]